Repository: DarkHeros09/Classic_Shop
Catalog: lib/src/localization/app_*.arb
Languages: ar

# account_blocked
source: Your account has been blocked. Please contact support.
ar: تم حظر حسابك. يرجى الاتصال بالدعم.

# account_locked
source: Your account has been locked due to multiple failed login attempts. Please try again later.
ar: تم قفل حسابك بسبب محاولات تسجيل دخول فاشلة متعددة. يرجى المحاولة لاحقًا.

source: All
ar: مشاهدة الكل

source: Best Sellers 🔥🏆
ar: الأكثر مبيعًا

# email_already_in_use
source: This email address is already in use. Please try another one.
ar: عنوان البريد الإلكتروني هذا مستخدم بالفعل. يرجى تجربة عنوان آخر.

# email_not_verified
source: Your email has not been verified. Please check your inbox.
ar: لم يتم التحقق من بريدك الإلكتروني. يرجى التحقق من صندوق الوارد الخاص بك.

source: Featured Products 🌟📌
ar: المنتجات المختارة 😍

# invalid_credentials
source: The credentials you provided are incorrect. Please try again.
ar: البيانات التي قدمتها غير صحيحة. يرجى المحاولة مرة أخرى.

# invalid_token
source: The token provided is invalid. Please request a new one.
ar: الرمز المقدم غير صالح. يرجى طلب رمز جديد.

# missing_token
source: Authentication token is missing. Please provide a valid token.
ar: رمز المصادقة مفقود. يرجى تقديم رمز صالح.

source: New Products ✨🆕
ar: المنتجات الجديدة

# otp_expired
source: The OTP has expired. Please request a new one.
ar: انتهت صلاحية رمز التحقق. يرجى طلب رمز جديد.

# otp_invalid
source: The OTP you entered is invalid. Please try again.
ar: رمز التحقق الذي أدخلته غير صالح. يرجى المحاولة مرة أخرى.

# password_expired
source: Your password has expired. Please reset your password.
ar: انتهت صلاحية كلمة المرور الخاصة بك. يرجى إعادة تعيين كلمة المرور.

# password_mismatch
source: Passwords do not match. Please try again.
ar: كلمتا المرور غير متطابقتين. يرجى المحاولة مرة أخرى.

# session_expired
source: Your session has expired. Please log in again.
ar: انتهت صلاحية الجلسة الخاصة بك. يرجى تسجيل الدخول مرة أخرى.

# too_many_attempts
source: Too many login attempts. Please try again after some time.
ar: عدد محاولات تسجيل الدخول كبير جدًا. يرجى المحاولة مرة أخرى بعد فترة.

# unauthorized
source: You are not authorized to access this resource.
ar: غير مصرح لك بالوصول إلى هذه الموارد.

# user_not_found
source: No account found with this email address.
ar: لا يوجد حساب مرتبط بهذا البريد الإلكتروني.
